"Nightly" = "Πειραματική";
"Stable" = "Σταθερή";
"Unstable" = "Δοκιμαστική";

"File Drawer" = "Συρτάρι Αρχείων";
"Hot Keys" = "Συντομεύσεις";
"Output" = "Έξοδος";

"Remote" = "Τηλεχειριστήριο";
"Updates" = "Ενημερώσεις";
"Last.fm" = "Last.fm";

"Press Key..." = "Πατήστε το πλήκτρο...";
